AcDbSurface.usesGraphicsCache
This method is used by AutoCAD to determine whether or not to use
cached graphics for the object.  If the method returns true, then
cached graphics will be used.  The default implementation is to
return true. Only database resident entities can use graphics
caching, so this method is not called for entities not in an AcDbDatabase.

AcDbSurface.convertToNurbSurface(AcArray&lt;AcDbNurbSurface**,AcArrayMemCopyReallocator&lt;AcDbNurbSurface**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Convert to nurb surfaces. The caller should free the returned nurb surface.
nsArray:
The generated Nurb Surface array
Returns:
Return Acad::eOk if successful.

AcDbSurface.rayTest(AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,AcArray&lt;AcDbSubentId,AcArrayObjectCopyReallocator&lt;AcDbSubentId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;System.Double,AcArrayMemCopyReallocator&lt;System.Double&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Ray test with the surface. This function will create a ray starting
from rayBasePoint with ray direction defined by rayDir. The rayRadius
defines the tolerance during the intersection check. The returned
subentities could be faces/edges/vertices.
rayBasePoint:
Input base point of the ray.
rayDir:
Input ray direction.
rayRadius:
input tolerance during the intersection check.
subEntIds:
Returned array including faces, edges and vertices.
parameters:
Returned array of doubles indicating the intersection
parameter on the ray with the returned subentities.
The smaller of the parameter, the closer to the base point.
Returns:
Return Acad::eOk if successful.

AcDbSurface.extendEdges(AcArray&lt;AcDbFullSubentPath,AcArrayObjectCopyReallocator&lt;AcDbFullSubentPath&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,AcDbSurface.EdgeExtensionType,System.Boolean)
Extends the edges of this surface by mergeing the extended/stretched
edges to existing surface.
edges:
Input full sub-entity paths of the edges, that needs to be extended.
extDist:
Input distance by which surface needs to be extended.
extOption:
Extension option, if edges needs to be extended or stretched.
bAssociativeEnabled:
Specifies whether extend surface associativity is enabled.
Returns:
Acad::eOk if successful.

AcDbSurface.modificationActionBodyIds(AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Get moddification action body IDs.
modificationActionBodyIds:
An array to store the returned action body IDs.
Returns:
eOk if successful.

AcDbSurface.creationActionBodyId
Get creation action body ID.
Returns:
Creation action body id.

AcDbSurface.getPerimeter(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Return the perimeter of surface.
perimeter:
Perimeter of surface.
Returns:
eOk if successful.

AcDbSurface.setWireframeType(AcDbSurface.WireframeType)
Set WireframeType.
type:
WireframeType to set.
Returns:
eOk if successful.

AcDbSurface.getWireframeType
Get WireframeType.
Returns:
WireframeType.

AcDbSurface.filletEdges(AcArray&lt;AcDbSubentId**,AcArrayMemCopyReallocator&lt;AcDbSubentId**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Boolean)
This method creates associative fillets at the specified edges of the
surface based on input bAssociativeEnabled.
edgeSubentIds:
Input object ids of the edges where the fillet will be applied.
radius:
Input fillet radius.
bAssociativeEnabled:
A flag to indicate whether chamfer needs to be associative.
Returns:
eOk if successful.

AcDbSurface.chamferEdges(AcArray&lt;AcDbSubentId**,AcArrayMemCopyReallocator&lt;AcDbSubentId**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Double,System.Boolean)
This method creates associative chamfers at the specified edges of the
surface based on input bAssociativeEnabled.
edgeSubentIds:
Input object ids of edges at which the chamfer will be applied.
baseFaceSubentId:
Input object id of the base face where the chamfer will be applied.
baseDist:
Input chamfer distance on the base face.
otherDist:
Input chamfer distance on the other faces.
bAssociativeEnabled:
A flag to indicate whether chamfer needs to be associative.
Returns:
eOk if successful.

AcDbSurface.trimSurface(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcGeVector3d,AcArrayMemCopyReallocator&lt;AcGeVector3d&gt;&gt;!System.Runtime.CompilerServices.IsConst,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenc
Trims a surface with given cutting surfaces/curves. A surface can be trimmed by other surfaces
or curves. When curves are used, the actual trimming boundary is formed by projecting the curves
onto the surface, so the additional information of project direction needs to be provided.
blankSurfaceId:
Original input surface to be trimmed.
toolIds:
array of ids of cutting entities that their bodies will be directly used to trim the
surface without further treatment such as projection.
toolCurveIds:
array of ids of cutting curves that will be used to trim the surface by first
projecting them to the surface
projVectors:
array of projection direction of each cutting curve in toolCurveIds, so the length of projVectors
should be equal to the length of toolCurveIds
pickPoint:
pick point that is used to specify which area of a surface should be trimmed.
viewVector:
when using pick point to find out which area to trim, caller should also specify the view direction
which will be used form a ray starting from the pick point in the view direction and see which area
is hit by the ray first.
bAutoExtend:
If this option is set then when a tool body consists of a single face with analytic geometry,
the underlying geometry will be extended as much as possible to make sure the surface is trimmed.
The tool body supplied will not be modified.
bAssociativeEnabled:
Specifies whether the surface trimming operation should be associative.
Returns:
eOk if successful.

AcDbSurface.createExtendSurface(AcDbObjectId,AcArray&lt;AcDbSubentId,AcArrayObjectCopyReallocator&lt;AcDbSubentId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,AcDbSurface.EdgeExtensionType,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates an extend surface from the given set of edges from a surface
and adds the surface to the current database. All input edges
should be connected and coming from same surface.
sourceSurface:
Surface id from which edges needs to be extended to create extend surface.
edges:
Input full sub-entity paths of the edges, that needs to be extended.
extDist:
Input distance by which surface needs to be extended.
extOption:
Extension option, if edges needs to be extended or stretched.
bAssociativeEnabled:
Specifies whether extend surface associativity is enabled.
newExtendSurfaceId:
ObjectId to the extend surface if created successfully.
Returns:
Acad::eOk if successful.

AcDbSurface.createOffsetSurface(AcDbEntity*,System.Double,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates an offset surface and adds it to the current database.
pInputSurface:
Original input surface to be offset.
offsetDistance:
Input distance to offset the input surface.
bAssociativeEnabled:
Specifies whether patch surface associativity is enabled.
offsetSurfaceId:
Object id of offset surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createOffsetSurface(AcDbEntity*,System.Double,AcDbEntity**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates an offset surface.
pInputSurface:
Original input surface to be offset.
offsetDistance:
Input distance to offset the input surface.
offsetSurface:
Pointer to the new offset surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createFilletSurface(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,AcDb.FilletTrimMode,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a tangent surface between two surface edges with constant radius
and trim or no trim the original surfaces to it.
surfId1:
Input objectID of the first source surface.
pickPt1:
Input 3D point specifying the side on the first source surface you want to
keep after filleting.
surfId2:
Input objectID of the second source surface.
pickPt2:
Input 3D point specifying the side on the second source surface you want to
keep after filleting.
radius:
Input positive value specifying radius for fillet operation.
trimMode:
Input flag specifying enum value of kTrimNone, kTrimFirst, kTrimSecond or
kTrimBoth.
projDir:
Input 3D vector specifying the projection (view) direction for pick points.
This vector is used for calculation of the projection point on the source
surfaces for pickPt1 and pickPt2.
bAssociativeEnabled:
Specifies whether filltet surface associativity is enabled.
newSurfaceId:
Object id of fillet surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createFilletSurface(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,AcDb.FilletTrimMode,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a tangent surface between two surface edges with constant radius
and trim or no trim the original surfaces to it.
surfId1:
Input objectID of the first source surface.
pickPt1:
Input 3D point specifying the side on the first source surface you want to
keep after filleting.
surfId2:
Input objectID of the second source surface.
pickPt2:
Input 3D point specifying the side on the second source surface you want to
keep after filleting.
radius:
Input positive value specifying radius for fillet operation.
trimMode:
Input flag specifying enum value of kTrimNone, kTrimFirst, kTrimSecond or
kTrimBoth.
projDir:
Input 3D vector specifying the projection (view) direction for pick points.
This vector is used for calculation of the projection point on the source
surfaces for pickPt1 and pickPt2.
filletSurface:
Pointer to the fillet surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createBlendSurface(AcDbLoftProfile*,AcDbLoftProfile*,AcDbBlendOptions*,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a blend surface from the given profiles using the specified options
and adds it to the current database. The startProfile and endProfile must
be edges or a set of connected edges.
startProfile:
Input profile to be used as the start for blend operation.
endProfile:
Input profile to be used as the end for blend operation.
blendOptions:
Input blend options.
bAssociativeEnabled:
Specifies whether blend surface associativity is enabled.
newSurfaceId:
Object id of blend surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createBlendSurface(AcDbLoftProfile*,AcDbLoftProfile*,AcDbBlendOptions*,AcDbSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a blend surface from the given profiles using the specified options
and adds it to the current database. The startProfile and endProfile must
be edges or a set of connected edges.
startProfile:
Input profile to be used as the start for blend operation.
endProfile:
Input profile to be used as the end for blend operation.
blendOptions:
Input blend options.
blendSurface:
Pointer to the blend surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createPatchSurface(AcDbPathRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,System.Double,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Create an associative patch surface by specifying one of the following:
+ edges which must form a closed loop.
+ profile curves which must form a closed loop
The API doesn't support mixing the two yet.
The constraintIds are optional which specify the objectID of curve or point
to be passed by the patch surface as constraint.
Continuity and bulge only apply to boundary edges, not the constraint curves.
pathRef:
Input edge reference which can be edges of entities or proflie curves
constraintIds:
Optional contrainted curve or point.
continuity:
Optional continuity for patch created with edges
bulge:
Optional bulge for patch created with edges
bAssociativeEnabled:
Specifies whether patch surface associativity is enabled.
newSurfaceId:
Object id of patch surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createPatchSurface(AcDbPathRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbObjectId,AcArrayMemCopyReallocator&lt;AcDbObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,System.Double,AcDbSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Create patch surface by specifying one of the following:
+ edges which must form a closed loop.
+ profile curves which must form a closed loop
The API doesn't support mixing the two yet.
The constraintIds are optional which specify the objectID of curve or point
to be passed by the patch surface as constraint.
Continuity and bulge only apply to boundary edges, not the constraint curves.
pathRef:
Input edge reference which can be edges of entities or proflie curves
constraintIds:
Optional contrainted curve or point.
continuity:
Optional continuity for patch created with edges
bulge:
Optional bulge for patch created with edges
newSurface:
Pointer to the new patch surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createNetworkSurface(AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a network surface and adds it to the current database.
A network surface is similar to a lofted surface where the u profiles are
cross sections and the v profiles are guides.  But unlike the lofted surface,
the v profiles do not need to intersect the u profiles.  If the two sets of
profiles do not all intersect then in general the profiles will not lie on
the resulting surface.
crossSections:
Input array of u-direction profiles.
guides:
Input array of v-direction profiles.
bAssociativeEnabled:
Specifies whether network surface associativity is enabled.
newSurfaceId:
Object id of network surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createNetworkSurface(AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a network surface and adds it to the current database.
A network surface is similar to a lofted surface where the u profiles are
cross sections and the v profiles are guides.  But unlike the lofted surface,
the v profiles do not need to intersect the u profiles.  If the two sets of
profiles do not all intersect then in general the profiles will not lie on
the resulting surface.
crossSections:
Input array of u-direction profiles.
guides:
Input array of v-direction profiles.
newSurface:
Pointer to the new network surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createLoftedSurface(AcArray&lt;AcDbLoftProfile**,AcArrayMemCopyReallocator&lt;AcDbLoftProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbLoftProfile**,AcArrayMemCopyReallocator&lt;AcDbLoftProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbLoftProfile*,AcDbLoftOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a lofted surface from the given profiles using the specified options
and adds it to the current database.  The cross sections, guides, and path
may be entities such as curves or points, or they may be edges or sets of
connected edges.  The cross sections must be either all open or all closed.
If the cross sections are all closed, then this function will accept a point
entity as the first and/or last list entry.  Each profile in the guides list
must intersect each of the cross-section profiles, so the guides form a
net-like structure with the cross-sections. Both the cross-section profiles
and the guide profiles will lie on the resulting surface. If any guide profiles
are passed in this list, then pPath should be null. If pPath is non-null, then
the resulting surface will follow the shape of this profile as much as possible.
This profile does not need to intersect the cross-section profiles and does not
even need to be near the cross sections.
crossSections:
Input array of profiles to be used as cross sections for the lofting operation.
guides:
Input optional array of guide profiles.
pPath:
Input optional path profile.
loftOptions:
Input loft options.
bAssociativeEnabled:
Specifies whether lofted surface associativity is enabled.
newSurfaceId:
Object id of lofted surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createLoftedSurface(AcArray&lt;AcDbLoftProfile**,AcArrayMemCopyReallocator&lt;AcDbLoftProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbLoftProfile**,AcArrayMemCopyReallocator&lt;AcDbLoftProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbLoftProfile*,AcDbLoftOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a lofted surface from the given profiles using the specified options
and adds it to the current database.  The cross sections, guides, and path
may be entities such as curves or points, or they may be edges or sets of
connected edges.  The cross sections must be either all open or all closed.
If the cross sections are all closed, then this function will accept a point
entity as the first and/or last list entry.  Each profile in the guides list
must intersect each of the cross-section profiles, so the guides form a
net-like structure with the cross-sections. Both the cross-section profiles
and the guide profiles will lie on the resulting surface. If any guide profiles
are passed in this list, then pPath should be null. If pPath is non-null, then
the resulting surface will follow the shape of this profile as much as possible.
This profile does not need to intersect the cross-section profiles and does not
even need to be near the cross sections.
crossSections:
Input array of profiles to be used as cross sections for the lofting operation.
guides:
Input optional array of guide profiles.
pPath:
Input optional path profile.
loftOptions:
Input loft options.
newSurface:
Pointer to the new lofted surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createSweptSurface(AcDb3dProfile*,AcDb3dProfile*,AcDbSweepOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a swept surface from the given profile using the specified options.
pSweep:
Input profile to be swept.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
pPath:
Input profile along which pSweep is to be swept.  This must be a curve or
an edge.
sweepOptions:
Input sweep options.
bAssociativeEnabled:
Specifies whether swept surface associativity is enabled.
newSurfaceId:
Object id of swept surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createSweptSurface(AcDb3dProfile*,AcDb3dProfile*,AcDbSweepOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSweptSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a swept surface from the given profile using the specified options.
pSweep:
Input profile to be swept.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
pPath:
Input profile along which pSweep is to be swept.  This must be a curve or
an edge.
sweepOptions:
Input sweep options.
newSweptSurface:
Pointer to the new swept surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createRevolvedSurface(AcDb3dProfile*,AcDb3dProfile*,System.Boolean,System.Double,System.Double,AcDbRevolveOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a revolved surface from the given profile using the specified options.
pRev:
Input profile to be revolved.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
pAxis:
Profile which is either a line or a linear edge of a surface or solid.
flipAxisDirection:
True if the direction of the axis should be taken in the opposite direction of
the entity defined by pAxis.
revAngle:
Angle through which the profile is to be revolved.  This angle is taken to be
counter-clockwise about the axis of revolution.
startAngle:
Starting angle of the profile.  If this parameter is 0.0 then the profile will
be revolved from its current position.  This angle is taken to be
counter-clockwise about the axis of revolution.
flipAxisDirection:
This parameter is only relevant when pAxisEnt is non-null.
In this case this parameter specifies
revolveOptions:
Input revolve options.
bAssociativeEnabled:
Specifies whether revolved surface associativity is enabled.
newRevolvedSurfaceId:
ObjectId to te new revolved surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createRevolvedSurface(AcDb3dProfile*,AcDb3dProfile*,System.Boolean,System.Double,System.Double,AcDbRevolveOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbRevolvedSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a revolved surface from the given profile using the specified options.
pRev:
Input profile to be revolved.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
pAxis:
Profile which is either a line or a linear edge of a surface or solid.
flipAxisDirection:
True if the direction of the axis should be taken in the opposite direction of
the entity defined by pAxis.
revAngle:
Angle through which the profile is to be revolved.  This angle is taken to be
counter-clockwise about the axis of revolution.
startAngle:
Starting angle of the profile.  If this parameter is 0.0 then the profile will
be revolved from its current position.  This angle is taken to be
counter-clockwise about the axis of revolution.
flipAxisDirection:
This parameter is only relevant when pAxisEnt is non-null.
In this case this parameter specifies
revolveOptions:
Input revolve options.
newRevolvedSurface:
Pointer to te new revolved surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createRevolvedSurface(AcDb3dProfile*,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Double,AcDbRevolveOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a revolved surface from the given profile using the specified options.
pRev:
Input profile to be revolved.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
axisPnt:
Any point on the axis of revolution.
axisDir:
Direction vector of the axis of revolution.  This vector must not be zero-length.
revAngle:
Angle through which the profile is to be revolved.  This angle is taken to be
counter-clockwise about the axis of revolution.
startAngle:
Starting angle of the profile.  If this parameter is 0.0 then the profile will
be revolved from its current position.  This angle is taken to be
counter-clockwise about the axis of revolution.
revolveOptions:
Input revolve options.
bAssociativeEnabled:
Specifies whether revolved surface associativity is enabled.
newRevolvedSurface:
Pointer to new revolved surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createRevolvedSurface(AcDb3dProfile*,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Double,AcDbRevolveOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbRevolvedSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a revolved surface from the given profile using the specified options.
pRev:
Input profile to be revolved.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
axisPnt:
Any point on the axis of revolution.
axisDir:
Direction vector of the axis of revolution.  This vector must not be zero-length.
revAngle:
Angle through which the profile is to be revolved.  This angle is taken to be
counter-clockwise about the axis of revolution.
startAngle:
Starting angle of the profile.  If this parameter is 0.0 then the profile will
be revolved from its current position.  This angle is taken to be
counter-clockwise about the axis of revolution.
revolveOptions:
Input revolve options.
newRevolvedSurface:
Pointer to new revolved surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createExtrudedSurface(AcDb3dProfile*,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSweepOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates an extruded surface from the given profile using the specified options
and adds the surface to the current database.
pSweep:
Input profile to be extruded.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
directionVec:
Input direction of extrusion.  This vector must not be zero-length.
sweepOptions:
Input sweep options.
bAssociativeEnabled:
Specifies whether extruded surface associativity is enabled.
newExtrudedSurfaceId:
ObjectId to the extruded surface if created successfully.
Returns:
eOk if successful.

AcDbSurface.createExtrudedSurface(AcDb3dProfile*,AcGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSweepOptions*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbExtrudedSurface**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates an extruded surface from the given profile using the specified options
and adds the surface to the current database.
pSweep:
Input profile to be extruded.  This may be an entity such as a curve or
planar surface or it may be an edge or set of connected edges.
directionVec:
Input direction of extrusion.  This vector must not be zero-length.
sweepOptions:
Input sweep options.
newExtrudedSurface:
Pointer to the extruded surface if created successfully.
Returns:
eOk if successful.